AUTO_config_TK_pesok/src/Documents/ТК_АктСверкиВзаиморасчетов/ТК_АктСверкиВзаиморасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ТК_АктСверкиВзаиморасчетов</name>
  <posting>Deny</posting>
  <attributes>
    <name>Организация</name>
    <comment>Юридическое лицо, от которого выписан документ</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <comment>Поставщик/комитент от которого мы получили товар</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Произвольный комментарий к документу</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставительОрганизации</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставительКонтрагента</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ОстатокНаНачало</name>
    <comment>(Общ) Остаток на начало </comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расхождение</name>
    <comment>(Общ) Остаток на конец</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СверкаСогласована</name>
    <comment>Признак согласования сверки</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозОперация</name>
    <comment>Выполняемая документом операция</comment>
    <type>
      <types>CatalogRef.ХозОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеКомпании</name>
    <comment>Подразделение компании в котором был выписан документ</comment>
    <type>
      <types>CatalogRef.ПодразделенияКомпании</types>
    </type>
  </attributes>
  <attributes>
    <name>РегламентированныйУчет</name>
    <comment>Флаг отражения документа в регламентированном учете</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <comment>Автор документа - пользователь, создавший документ.</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьПредставителяОрганизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьПредставителяКонтрагент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПоДаннымОрганизации</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дебет</name>
      <comment>(Общ) Дебет: увеличение долга контрагента</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Кредит</name>
      <comment>(Общ) Кредит: увеличение долга организации</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументРегистратор</name>
      <comment>(Общ)</comment>
      <type>
        <types>DocumentRef.РеализацияТоваров</types>
        <types>DocumentRef.РасходныйКассовыйОрдер</types>
        <types>DocumentRef.ВозвратПоставщику</types>
        <types>DocumentRef.ЗаказПоставщику</types>
        <types>DocumentRef.ВыпускПродукции</types>
        <types>DocumentRef.ТК_Взаимозачет</types>
        <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.ТК_Переработка</types>
        <types>DocumentRef.ВозвратОтПокупателя</types>
        <types>DocumentRef.ПоступлениеТоваров</types>
        <types>DocumentRef.ТК_КорректировкаДолга</types>
        <types>DocumentRef.ЗаказПокупателя</types>
        <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.ПриходныйКассовыйОрдер</types>
        <types>DocumentRef.КорректировкаРегистров</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПоДаннымКонтрагента</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дебет</name>
      <comment>(Общ) Дебет: увеличение долга контрагента</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Кредит</name>
      <comment>(Общ) Кредит: увеличение долга организации</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументРегистратор</name>
      <comment>(Общ)</comment>
      <type>
        <types>DocumentRef.РеализацияТоваров</types>
        <types>DocumentRef.РасходныйКассовыйОрдер</types>
        <types>DocumentRef.ВозвратПоставщику</types>
        <types>DocumentRef.ЗаказПоставщику</types>
        <types>DocumentRef.ВыпускПродукции</types>
        <types>DocumentRef.ТК_Взаимозачет</types>
        <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.ТК_Переработка</types>
        <types>DocumentRef.ВозвратОтПокупателя</types>
        <types>DocumentRef.ПоступлениеТоваров</types>
        <types>DocumentRef.ТК_КорректировкаДолга</types>
        <types>DocumentRef.ЗаказПокупателя</types>
        <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.ПриходныйКассовыйОрдер</types>
        <types>DocumentRef.КорректировкаРегистров</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоговорыВзаиморасчетов</name>
    <attributes>
      <name>ДоговорВзаиморасчетов</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

AUTO_config_TK_pesok/src/Documents/ТК_АктСверкиВзаиморасчетов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ИнициализироватьДокумент(ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ИнициализироватьДокумент(ДанныеЗаполнения = Неопределено)

	Автор 					= Пользователи.ТекущийПользователь(); 
	ВалютаДокумента 	  	= ЗначениеНастроекПовтИсп.ПолучитьВалютуРегламентированногоУчета(ВалютаДокумента);
	Организация           	= ЗначениеНастроекПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Автор,"ОсновнаяОрганизация",,Организация);	
	ПодразделениеКомпании 	= ЗначениеНастроекПовтИсп.ПодразделениеПользователя(Автор, ПодразделениеКомпании);
	Дата 					= ТекущаяДата();
	РегламентированныйУчет 	= Истина;
	
КонецПроцедуры


#КонецЕсли
